src/Documents/ПередачаВПереработку/ПередачаВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВПереработку</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПереработку</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезСпецификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПередачаВПереработку/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТЧ Из Объект.БарКоды Цикл
	ТЧ.Товар = ОбщийМодульВызовСервера.ПолучитьТоварПоБарКоду(ТЧ.БарКод);
	КонецЦикла; 	
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации,КолУзла)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,Объект.Дата);
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ = Объект.ТабличнаяЧасть.Добавить();
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		ТЧ.МПЗ = ВыборкаНР.Элемент;
		ТЧ.Количество = ВыборкаНР.Норма*КолУзла;
		ТЧ.ЕдиницаИзмерения = ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения;					
		Иначе
			Если Не ВыборкаНР.Элемент.Канбан.Пустая() Тогда
			ТЧ = Объект.ТабличнаяЧасть.Добавить();
			ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
			ТЧ.МПЗ = ВыборкаНР.Элемент;
			ТЧ.Количество = ВыборкаНР.Норма*КолУзла;
			ТЧ.ЕдиницаИзмерения = ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения;					
			Продолжить;						
			КонецЕсли; 				
		РаскрытьНаМПЗ(ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаНормыРасходов(ЭтапСпецификации,КолУзла)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходовСрезПоследних.Норма,
	|	НормыРасходов.Ссылка
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходов.Владелец = &Владелец
	|	И (ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Номенклатура)
	|			ИЛИ ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Материалы))
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", Объект.Дата);
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНР = РезультатЗапроса.Выбрать();
	Пока ВыборкаНР.Следующий() Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		Иначе	
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		КонецЕсли;
	ТЧ.МПЗ = ВыборкаНР.Элемент;
	ТЧ.Количество = ВыборкаНР.Норма*КолУзла;
	ТЧ.ЕдиницаИзмерения = ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНоменклатуры()
СписокНоменклатуры = Новый СписокЗначений;
Запрос = Новый Запрос;

	Для каждого ТЧ Из Объект.ДокументОснование.ТабличнаяЧасть Цикл
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаВПереработку.Количество
		|ИЗ
		|	Документ.ПередачаВПереработку КАК ПередачаВПереработку
		|ГДЕ
		|	ПередачаВПереработку.ДокументОснование = &ДокументОснование
		|	И ПередачаВПереработку.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("Номенклатура", ТЧ.МПЗ);
	РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
		СписокНоменклатуры.Добавить(ТЧ.МПЗ);
		КонецЕсли;	
	КонецЦикла; 	
Возврат(СписокНоменклатуры);
КонецФункции 

&НаСервере
Функция ПолучитьКоличествоНоменклатуры(Номенклатура)
	Для каждого ТЧ Из Объект.ДокументОснование.ТабличнаяЧасть Цикл
		Если ТЧ.МПЗ = Номенклатура Тогда
		Возврат(ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения));	
		КонецЕсли; 	
	КонецЦикла; 	
Возврат(0);
КонецФункции 

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Не Объект.ДокументОснование.Пустая() Тогда
	СтандартнаяОбработка = Ложь;
	СписокНоменклатуры = ПолучитьСписокНоменклатуры();
		Если СписокНоменклатуры.Количество() > 0 Тогда
		Выбор = СписокНоменклатуры.ВыбратьЭлемент("Выберите номенклатуру");
			Если Выбор <> Неопределено Тогда
			Объект.Номенклатура = Выбор.Значение;
			Объект.Количество = ПолучитьКоличествоНоменклатуры(Объект.Номенклатура);
			КонецЕсли;
		Объект.ТабличнаяЧасть.Очистить(); 
			Если ТипЗнч(Объект.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			РаскрытьНаМПЗ(Объект.Номенклатура,Объект.Количество);
			Иначе
			РаскрытьНаНормыРасходов(Объект.Номенклатура,Объект.Количество);		
			КонецЕсли;
		Иначе
		Сообщить("Вся номенклатура отдана в переработку!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.ПередачаВПереработку.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");

ОблШапка.Параметры.НомерДок = Объект.Номер;
ОблШапка.Параметры.ДатаДок = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.НазваниеОрганизации = Константы.НазваниеОрганизации.Получить();
ОблШапка.Параметры.КодОКПО = Константы.КодОКПО.Получить();
ОблШапка.Параметры.МестоХранения = СокрЛП(Объект.МестоХранения.Наименование);
//ОблШапка.Параметры.Подразделение = СокрЛП(Объект.Подразделение.Наименование);
ОблШапка.Параметры.Контрагент = СокрЛП(Объект.Контрагент.Наименование);
ОблШапка.Параметры.Договор = СокрЛП(Объект.Договор.Наименование);
ТабДок.Вывести(ОблШапка);
КоличествоСтрок = 0;
//ИтогНДС = 0;
ИтогВсего = 0;
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы Тогда
		ОблСтрока.Параметры.КоррСчет = "10.1";	
		ОблСтрока.Параметры.НоменклатурныйНомер = ТЧ.МПЗ.Код;	
		Иначе
		ОблСтрока.Параметры.КоррСчет = "21";
		ОблСтрока.Параметры.НоменклатурныйНомер = "";	
		КонецЕсли;
	ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблСтрока.Параметры.КодЕдиницыИзмерения = ТЧ.ЕдиницаИзмерения.ЕдиницаИзмерения.Код;
	ОблСтрока.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.ЕдиницаИзмерения.Наименование);
	Цена = ОбщийМодульВызовСервера.ПолучитьСтоимостьМПЗ(ТЧ.МПЗ,1,ТекущаяДата(),0);
	ОблСтрока.Параметры.НадлежитОтпустить = ТЧ.Количество;
	ОблСтрока.Параметры.Отпущено = ТЧ.Количество;
	ОблСтрока.Параметры.Цена = Цена;
	ОблСтрока.Параметры.Сумма = Цена*ТЧ.Количество;
	//НДС = ОблСтрока.Параметры.Сумма*Константы.ОсновнаяСтавкаНДС.Получить().Ставка/100;
	//ОблСтрока.Параметры.НДС = НДС;
	//ОблСтрока.Параметры.Всего = ОблСтрока.Параметры.Сумма+НДС; 
	ТабДок.Вывести(ОблСтрока);
	КоличествоСтрок = КоличествоСтрок + 1;
	//ИтогНДС = ИтогНДС + ОблСтрока.Параметры.НДС;
	ИтогВсего = ИтогВсего + ОблСтрока.Параметры.Сумма;
	КонецЦикла;
ОблПодвал.Параметры.КоличествоСтрок = СтрЗаменить(ЧислоПрописью(КоличествоСтрок, "Л=ru_RU"),"00","");
ОблПодвал.Параметры.ИтогНДС = ЧислоПрописью(0.00, "Л=ru_RU;ДП=Ложь", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
ОблПодвал.Параметры.ИтогВсего = ЧислоПрописью(ИтогВсего, "Л=ru_RU;ДП=Ложь", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
ТабДок.Вывести(ОблПодвал);
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
ТД = ПечатьНаСервере();
ТД.Показать("Печать М-15");
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
КоличествоПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура КоличествоПриИзмененииНаСервере()
Объект.ТабличнаяЧасть.Очистить(); 
	Если Объект.БезСпецификации Тогда
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(Объект.Номенклатура) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;	
		Иначе	
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
		КонецЕсли; 
	ТЧ.МПЗ = Объект.Номенклатура;
	ТЧ.Количество = Объект.Количество;
	ТЧ.ЕдиницаИзмерения = Объект.Номенклатура.ОсновнаяЕдиницаИзмерения;	
	Иначе	
		Если ТипЗнч(Объект.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		РаскрытьНаМПЗ(Объект.Номенклатура,Объект.Количество);
		Иначе
		РаскрытьНаНормыРасходов(Объект.Номенклатура,Объект.Количество);		
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Отказ = Не ЭтаФорма.ПроверитьЗаполнение(); 
КонецПроцедуры

&НаСервере
Процедура БезСпецификацииПриИзмененииНаСервере()
Объект.ТабличнаяЧасть.Очистить();
Объект.ТабличнаяЧасть.Очистить(); 
	Если Объект.БезСпецификации Тогда
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(Объект.Номенклатура) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;	
		Иначе	
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
		КонецЕсли; 
	ТЧ.МПЗ = Объект.Номенклатура;
	ТЧ.Количество = Объект.Количество;
	ТЧ.ЕдиницаИзмерения = Объект.Номенклатура.ОсновнаяЕдиницаИзмерения;	
	Иначе	
		Если ТипЗнч(Объект.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		РаскрытьНаМПЗ(Объект.Номенклатура,Объект.Количество);
		Иначе
		РаскрытьНаНормыРасходов(Объект.Номенклатура,Объект.Количество);		
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура БезСпецификацииПриИзменении(Элемент)
БезСпецификацииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоКоду(БарКод)
Выборка = Объект.БарКоды.НайтиСтроки(Новый Структура("БарКод",СокрЛП(БарКод)));
	Если Выборка.Количество() = 0 Тогда
	ТЧ = Объект.БарКоды.Добавить();
	ТЧ.БарКод = БарКод;
	ТЧ.Товар = ОбщийМодульВызовСервера.ПолучитьТоварПоБарКоду(БарКод);
	Иначе	
	Сообщить("Бар-код уже отсканирован!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	ДобавитьПоКоду(Данные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БарКодыБарКодПриИзменении(Элемент)
Элементы.БарКоды.ТекущиеДанные.Товар = ОбщийМодульВызовСервера.ПолучитьТоварПоБарКоду(Элементы.БарКоды.ТекущиеДанные.БарКод);
КонецПроцедуры
